app/views/courses/_listing.html.erb

                    <p class="card-text"><%= object.description%></p>
                    <% if logged_in? && !(current_student.courses.include?(object))%>
---
SELECT "courses".* FROM "courses" INNER JOIN "student_courses" ON "courses"."id" = "student_courses"."course_id" WHERE "student_courses"."student_id" = ?  [["student_id", 6]]
SELECT 1 AS one FROM "courses" INNER JOIN "student_courses" ON "courses"."id" = "student_courses"."course_id" WHERE "student_courses"."student_id" = ? AND "courses"."id" = ? LIMIT ?  [["student_id", 6], ["id", 2], ["LIMIT", 1]]