app/controllers/application_controller.rb

SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
    def current_student
        @current_student ||= Student.find(session[:current_student_id]) if session[:current_student_id]