app/controllers/courses_controller.rb

INSERT INTO "courses" ("short_name", "name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["short_name", "AA"], ["name", "analyst analyst"], ["description", "blablablabla"], ["created_at", "2024-02-26 02:55:01.643046"], ["updated_at", "2024-02-26 02:55:01.643046"]]
---
    def create
        @course = Course.new(config_params)
        if @course.save