app/controllers/sessions_controller.rb

    def create
        student = Student.find_by(email: params[:session][:email].downcase)
---
SELECT "students".* FROM "students" WHERE "students"."email" = ? LIMIT ?  [["email", "matila@gmail.com"], ["LIMIT", 1]]