app/controllers/student_courses_controller.rb

SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT 1 AS one FROM "courses" INNER JOIN "student_courses" ON "courses"."id" = "student_courses"."course_id" WHERE "student_courses"."student_id" = ? AND "courses"."id" = ? LIMIT ?  [["student_id", 9], ["id", 3], ["LIMIT", 1]]
INSERT INTO "student_courses" ("student_id", "course_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["student_id", 9], ["course_id", 3], ["created_at", "2024-03-04 17:28:05.910211"], ["updated_at", "2024-03-04 17:28:05.910211"]]
---
    def create
        add_course = Course.find(params[:course_id])
        unless current_student.courses.include?(add_course)
            StudentCourse.create(course: add_course, student: current_student)

SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "student_courses".* FROM "student_courses" WHERE "student_courses"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "courses" WHERE "courses"."id" = ?  [["id", 3]]
DELETE FROM "student_courses" WHERE "student_courses"."id" = ?  [["id", 4]]
---
    def destroy
        desenrollement = StudentCourse.find(params[:student_course_id])
        desenrollement.destroy