app/controllers/students_controller.rb

    def index
        @students = Student.all
---
SELECT "students".* FROM "students" WHERE (1) LIMIT ?  [["LIMIT", 1]]

    def create
        @student = Student.new(permit_params)
        if @student.save
---
INSERT INTO "students" ("name", "email", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["name", "Anderson"], ["email", "anderson@gmail.com"], ["created_at", "2024-02-28 19:40:51.737479"], ["updated_at", "2024-02-28 19:40:51.737479"], ["password_digest", "[FILTERED]"]]

    def update
        if @student.update(permit_params)
---
UPDATE "students" SET "name" = ?, "email" = ?, "updated_at" = ?, "password_digest" = ? WHERE "students"."id" = ?  [["name", "Steevy"], ["email", "steevy@gmail.com"], ["updated_at", "2024-02-28 20:12:06.143594"], ["password_digest", "[FILTERED]"], ["id", 8]]

    def destroy
        if @student.destroy
---
DELETE FROM "students" WHERE "students"."id" = ?  [["id", 7]]

    def find_params
        @student = Student.find(params[:id])
---
SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]